INSERT INTO roles (code, "value")
VALUES
(1, 'ADMIN'),
(2, 'GENERAL');


INSERT INTO users (id, role_code, name, password, email)
VALUES
(1, 1, '管理者太郎', '$2a$10$/D6s7mzc34Bqm2ycuCDsj.W9fh8APyhju7EdL6RxzbNvFUIT4oO3C', 'admin@mail.com'),
(2, 2, '一般二郎', '$2a$10$/D6s7mzc34Bqm2ycuCDsj.W9fh8APyhju7EdL6RxzbNvFUIT4oO3C', 'user@mail.com');
--passはいずれも"password"
--usersテーブル定義の変更、user_idカラムの変更、自動採番3から
ALTER TABLE users ALTER COLUMN id RESTART WITH 3;


INSERT INTO physical_details (user_id, created_at, weight, recorded_date)
VALUES
(1, '2026-02-06 22:49:01', 89.5, '2026-02-06'),
(1, '2026-02-07 22:49:01', 88.5, '2026-02-07'),
(1, '2026-02-08 22:49:01', 87.5, '2026-02-08'),
(1, '2026-02-09 22:49:01', 86.5, '2026-02-09'),
(1, '2026-02-10 22:49:01', 85.5, '2026-02-10'),
(1, '2026-02-11 22:49:01', 84.5, '2026-02-11'),
(1, '2026-02-12 22:49:01', 83.5, '2026-02-12'),
(1, '2026-02-13 22:49:01', 82.5, '2026-02-13'),
(1, '2026-02-14 22:49:01', 81.5, '2026-02-13'),
(1, '2026-02-15 22:49:01', 80.5, '2026-02-13'),
(1, '2026-02-16 22:49:01', 77.5, '2026-02-13'),
(1, '2026-02-17 22:49:01', 76.5, '2026-02-13'),
(1, '2026-02-18 22:49:01', 75.5, '2025-01-01'),
(2, '2026-02-14 22:50:05', 48.5, '2026-02-06');



